app/controllers/api_controller.rb

SELECT "b2b_users".* FROM "b2b_users"
INSERT INTO "b2b_users" ("username", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["username", "Grupo1"], ["password", "pass123"], ["created_at", "2015-05-16 19:39:37.781570"], ["updated_at", "2015-05-16 19:39:37.781570"]]
---
    def register_group
     @token
     @user = params['user']
     @pass = params['pass']

     #verify params params presence
     if !@user || !@pass
        @status = 400
        @body = {"user":["Este campo es requerido."],"pass":["Este campo es requerido."]}
        else

        #validate user (username not used)
        @used_username = 0
        B2bUser.all.each do |user|
            if user.username==@user
                @used_username = 1
            end
        end
        #if user OK

        if @used_username==0
            #create user

            @new_user = B2bUser.new
            @new_user.username = @user
            @new_user.password = @pass

            @new_user.save

SELECT "b2b_users".* FROM "b2b_users"
---
    def get_token
        @token
        @user = params['user']
        @pass = params['pass']

        #verify params presence
        if !@user || !@pass
            @status = 400
            @body = {"user":["Este campo es requerido."],"pass":["Este campo es requerido."]}
        else
            #verify user and pass
            @login_ok = 0
            B2bUser.all.each do |user|

SELECT "b2b_users".* FROM "b2b_users"
---
    def new_order
        @order_id = params['order_id']
        @token = params['token']
        #verify params presence
        if !@order_id || !@token
            @status = 400
            @body = {"order_id":["Este campo es requerido."],"token":["Este campo es requerido."]}
        else

            #verify token
            B2bUser.all.each do |user|

SELECT "b2b_users".* FROM "b2b_users"
---
    def order_canceled
        @order_id = params['order_id']
        @token = params['token']

        #verify params presence
        if !@order_id || !@token
            @status = 400
            @body = {"order_id":["Este campo es requerido."],"token":["Este campo es requerido."]}
        else
            #verify token
            B2bUser.all.each do |user|

SELECT "b2b_users".* FROM "b2b_users"
---
    def invoice_paid
        @invoice_id = params['invoice_id']
        @token = params['token']

        #verify params presence

        if !@invoice_id || !@token
            @status = 400
            @body = {"order_id":["Este campo es requerido."],"token":["Este campo es requerido."]}
        else
            #verify token
            B2bUser.all.each do |user|